Revit 2027 API
KeyBasedTreeEntryError.ErrorType Property
 Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeyBasedTreeEntryErrorType ErrorType { get; }
Public ReadOnly Property ErrorType As KeyBasedTreeEntryErrorType
	Get
public:
property KeyBasedTreeEntryErrorType ErrorType {
	KeyBasedTreeEntryErrorType get ();
}
member ErrorType : KeyBasedTreeEntryErrorType with get
Property Value
KeyBasedTreeEntryErrorType
See Also
Reference
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace